#-*- coding: utf-8 -*-
import random
man_list = [
'강주형','김민규','김민수','김종민','문형석','박성준','변근우','송준혁',
'안준서','윤홍현','이동건','이은성','임태빈','장현빈','정규석','정제일',
'채하늘','최보민','최준혁','최현우',
'곽지민','권신학','길민종','김진호','박승진','박지훈','박형빈','서훈',
'성민준','오창준','육도현','윤여준','이민하','이상준','이수','이재원',
'이준현','장호연','전태륜','조강준',
'김건','김대호','김도희','김동주','김상혁','김성빈','김준서','김태균',
'김현우','나태준','남동호','박기완','이승준','장경현','장준혁','정태규',
'천지우','최영호','황성하','황준용'
]
woman_list = [
'김란경','김태경','나지인','박유연','정민정','최자영',
'김승희','김현정','김화영','문수경','신다운','이가연',
'권예진','김소영','송여진','이승은','임서현','정다혜','정수민'
]
print '[*]1반 명단'
man1 = random.sample(range(60),60)
woman1 = random.sample(range(19),19)
for i in range(7):
	print "%d번" %(i+1), woman_list[woman1[i]],
for i in range(20):
	print "%d번" %(i+8) , man_list[man1[i]],
print ''

print '[*]2반 명단'
for i in range(6):
	print "%d번" %(i+1) , woman_list[woman1[i+7]],
for i in range(20):
	print "%d번" %(i+7) , man_list[man1[i+20]],
print ''

print '[*]3반 명단'
for i in range(6):
	print "%d번" %(i+1) , woman_list[woman1[i+13]],
for i in range(20):
	print "%d번" %(i+7) , man_list[man1[i+40]],